name = input("Назови своё имя ")
print("Хєлоу,", name,)
num = input ("Не хочеш посмотреть мемы с енотами?" )
if int != "i ne lox":
    print ("Вопрос был риторическим вот, держи \nhttps://www.youtube.com/watch?v=M3pDGot68xU&ab_channel=%D0%97%D0%B2%D0%B5%D1%80%D1%8E%D0%B3%D0%B8%D0%A2%D0%92 \nладно,шутки щутками,а сейчас пришло время показать тебе мои супер-пупер навыки анализа чисел")
num = int (input ("введите число: "))
if num > 0:
    print ("Вы ввели число больше 0")
    if num > 10:
         print ("вы ввели число больше 10")
    if num > 20:
        print ("вы ввели число больше 20")
if num < 0:
        print ("вы ввели число меньше 0")
if num < -10:
        print ("вы ввели число меньше -10")
if num < -20:
         print ("вы ввели число больше -20")
if num < -30:
        print ("вы ввели число больше -30")
